In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("nadym.csv", sep=";")
df

          tn       begin         end
0    2402491  01.06.2015  31.12.9999
1    2402513  01.10.2009  31.12.9999
2    2402513  01.03.2018  31.12.9999
3    2402515  11.09.1990  31.12.9999
4    2402515  01.03.2018  31.12.9999
..       ...         ...         ...
609  2454037  09.09.2020  31.12.9999
610  2454089  11.09.2020  31.12.9999
611  2454277  28.09.2020  31.12.9999
612  2454318  30.09.2020  31.12.9999
613  2454432  13.10.2020  31.12.9999

[614 rows x 3 columns]

In [3]:
df.iloc[1]

tn          2402513
begin    01.10.2009
end      31.12.9999
Name: 1, dtype: object

In [4]:
df_group = df.groupby("tn")

In [13]:
def filter_groups(groups):
    print(len(groups))
    tn = []
    count =[]
    for name, group in groups:
        if (len(group) > 1):
            tn.append(name)
            count.append(len(group))
    return tn, count

In [15]:
tn_list, count_list = filter_groups(df_group)

402

In [24]:
data = {"Таб.№": tn_list, "Количество": count_list}

In [25]:
df_tn = pd.DataFrame(data) 
df_tn

       Таб.№  Количество
0    2402513           2
1    2402515           2
2    2402917           3
3    2403223           2
4    2403302           2
..       ...         ...
200  2412559           2
201  2412560           2
202  2412563           2
203  2412569           2
204  2425180           2

[205 rows x 2 columns]

In [26]:
df_tn.info

<bound method DataFrame.info of        Таб.№  Количество
0    2402513           2
1    2402515           2
2    2402917           3
3    2403223           2
4    2403302           2
..       ...         ...
200  2412559           2
201  2412560           2
202  2412563           2
203  2412569           2
204  2425180           2

[205 rows x 2 columns]>